tap "cloudflare/cloudflare"
tap "github/gh"
tap "modularml/packages"
brew "ansible"
brew "bash"
brew "ca-certificates"
brew "coreutils"
brew "direnv"
brew "docker"
brew "dotnet@9"
brew "gettext"
brew "gh"
brew "git-filter-repo"
brew "git-lfs"
brew "gitlint"
brew "gnutls"
brew "jq"
brew "libidn2"
brew "libnghttp2"
brew "libunistring"
brew "markdownlint-cli"
brew "mas"
brew "mdformat"
brew "mpdecimal"
brew "nettle"
brew "node@22"
brew "opencode"
brew "openssl@3"
brew "p11-kit"
brew "pre-commit"
brew "python@3.14"
brew "readline"
brew "ruby"
brew "rust"
brew "rustup"
brew "swiftformat"
brew "swiftlint"
brew "terraform"
brew "unbound"
brew "uv"
brew "xcodegen"
brew "xz"
brew "yamllint"
brew "youtube-dl"
cask "1password"
cask "claude-code"
cask "claude"
cask "cmux"
cask "cursor"
cask "docker-desktop"
cask "google-chrome"
cask "google-drive"
cask "hp-easy-start"
cask "istat-menus@6"
cask "keybase"
cask "microsoft-remote-desktop"
cask "mqtt-explorer"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "signal"
cask "slack"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
mas "Xcode", id: 497799835
uv "djos"
vscode "4ops.terraform"
vscode "adpyke.vscode-sql-formatter"
vscode "anthropic.claude-code"
vscode "danielsanmedium.dscodegpt"
vscode "docker.docker"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
