tap "cloudflare/cloudflare"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "modularml/packages"
brew "ca-certificates"
brew "mpdecimal"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.11"
brew "awscli"
brew "bash"
brew "coreutils"
brew "direnv"
brew "docker-completion"
brew "docker"
brew "python@3.12"
brew "docutils"
brew "gettext"
brew "gh"
brew "git-secrets"
brew "libunistring"
brew "libidn2"
brew "libnghttp2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "openldap"
brew "pinentry"
brew "gnupg"
brew "go"
brew "icu4c"
brew "jq"
brew "just"
brew "keychain"
brew "mise"
brew "pinentry-mac"
brew "postgresql@14", restart_service: true
brew "pycparser", link: false
brew "python-setuptools"
brew "rustup-init"
brew "terraform"
brew "youtube-dl"
brew "youtubedr"
brew "modularml/packages/modular"
cask "1password"
cask "authy"
cask "charles"
cask "cleanmymac"
cask "discord"
cask "figma"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "hp-easy-start"
cask "istat-menus"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-remote-desktop"
cask "microsoft-word"
cask "mqtt-explorer"
cask "raycast"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
vscode "4ops.terraform"
vscode "adpyke.vscode-sql-formatter"
vscode "danielsanmedium.dscodegpt"
vscode "github.vscode-github-actions"
vscode "huggingface.huggingface-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
