tap "cloudflare/cloudflare"
tap "github/gh"
tap "modularml/packages"
brew "ca-certificates"
brew "openssl@3"
brew "mpdecimal"
brew "libunistring"
brew "gettext"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.14"
brew "ansible"
brew "bash"
brew "coreutils"
brew "direnv"
brew "libnghttp2"
brew "node"
brew "gemini-cli"
brew "gh"
brew "libidn2"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "go"
brew "jq"
brew "keychain"
brew "mas"
brew "pinentry-mac"
brew "pre-commit"
brew "python@3.13"
brew "rust"
brew "rustup"
brew "terraform"
brew "youtube-dl"
cask "1password"
cask "android-platform-tools"
cask "charles"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cursor"
cask "discord"
cask "figma"
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "hp-easy-start"
cask "istat-menus@6"
cask "keybase"
cask "kiro"
cask "kiro-cli"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-remote-desktop"
cask "microsoft-word"
cask "mqtt-explorer"
cask "raycast"
cask "rectangle"
cask "signal"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
mas "Home Assistant", id: 1099568401
mas "Okta Verify", id: 490179405
mas "WireGuard", id: 1451685025
vscode "4ops.terraform"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "danielsanmedium.dscodegpt"
vscode "docker.docker"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode.makefile-tools"
vscode "mtxr.sqltools"
